USE cafe_online_db;

-- таблица категорий
CREATE TABLE category_t (
    id INT NOT NULL AUTO_INCREMENT,
    title_f NVARCHAR(50) NOT NULL,

    PRIMARY KEY (id)
);

-- таблица блюд
CREATE TABLE dishes_t (
    id INT NOT NULL AUTO_INCREMENT,
    title_f NVARCHAR(50) NOT NULL,
    description_f NVARCHAR(300) NOT NULL,
    price_f DECIMAL(10, 2) NOT NULL,
    category_id INT NOT NULL,
    image_f NVARCHAR(200),

    PRIMARY KEY (id),
    FOREIGN KEY (category_id) REFERENCES category_t(id)
);

-- таблица заказов
CREATE TABLE order_t (
    id INT NOT NULL AUTO_INCREMENT,
    client_contacts_t NVARCHAR(250) NOT NULL,

    PRIMARY KEY (id)
);

-- расшивочная таблица для блюд и заказов
CREATE TABLE cafe_order_t (
    dishes_id INT NOT NULL,
    order_id INT NOT NULL,

    PRIMARY KEY (dishes_id, order_id),
    FOREIGN KEY (dishes_id) REFERENCES dishes_t(id),
    FOREIGN KEY (order_id) REFERENCES order_t(id)
);

-- добавление тестовых данных

-- вставка категорий
INSERT INTO category_t (title_f)
VALUES
    (N'Пицца'),
    (N'Бургер'),
    (N'Шаурма'),
    (N'Салаты'),
    (N'Напитки');

-- вставка блюд
INSERT INTO dishes_t (title_f, description_f, price_f, category_id, image_f)
VALUES
       -- Пицца
    (N'Пепперони', N'350г Колбаски пепперони, соус, сыр', 800, 1, 'pepperoni'),
    (N'Гавайская', N'350г Мясо курицы, ананас, соус, сыр', 900, 1, 'hawaii'),
    (N'Маргарита', N'350г Томатный соус, моцарелла, базилик', 750, 1, 'margherita'),
    (N'Четыре сыра', N'350г Смесь четырех сыров, томатный соус', 850, 1, 'four_cheese'),
    (N'Вегетарианская', N'350г Овощи, томатный соус, моцарелла', 700, 1, 'vegetarian'),
    (N'Мясная', N'350г Различные виды мяса, томатный соус, моцарелла', 950, 1, 'meat'),
    (N'Мексиканская', N'350г Острое мясо, перец халапеньо, томатный соус, моцарелла', 800, 1, 'mexican'),
    -- Бургеры
    (N'Гамбургер', N'300г Булка, котлета, соус, сыр', 400, 2, 'gamburger'),
    (N'Темный', N'300г Булка черная, котлета, соус, сыр', 400, 2, 'black'),
    (N'Чизбургер', N'Бургер с котлетой, сыром, соусом и овощами', 450, 2, 'cheeseburger'),
    (N'Барбекю', N'Бургер с котлетой, соусом барбекю, беконом и сыром', 500, 2, 'bbq'),
    (N'Куриный бургер', N'Бургер с куриной котлетой, салатом, помидором и майонезом', 400, 2, 'chicken_burger'),
    (N'Вегетарианский бургер', N'Бургер с овощной котлетой, сыром и соусом', 400, 2, 'vegetarian_burger'),
    (N'Двойной чизбургер', N'Бургер с двумя котлетами, двойным сыром и соусом', 550, 2, 'double_cheeseburger'),
    -- Шаурма
    (N'Куриная', N'300г Лаваш, курица, соус, салат, помидор, огурец', 300, 3, 'chicken'),
    (N'Сырная', N'300г Лаваш, курица, соус сырный, сыр', 350, 2, 'cheese'),
    (N'Говяжья', N'300г Лаваш, говядина, соус, салат, помидор, огурец', 350, 3, 'beef'),
    (N'Острая', N'300г Лаваш, курица, острый соус, салат, помидор, огурец', 320, 3, 'spicy'),
    (N'Вегетарианская', N'300г Лаваш, овощи, соус, салат, помидор, огурец', 280, 3, 'vegetarian'),
    (N'Классическая', N'300г Лаваш, свинина, соус, салат, помидор, огурец', 330, 3, 'classic'),
    (N'С грибами', N'300г Лаваш, курица, грибы, соус, салат, помидор, огурец', 340, 3, 'mushrooms'),
     -- Салаты
    (N'Цезарь с курицей', N'200г Сухарики, курица, соус, салат, помидор', 500, 4, 'caesar'),
    (N'Оливье', N'250г Яйца, колбаса, огурец, соус', 450, 4, 'olivier'),
    (N'Греческий', N'200г Огурцы, помидоры, перец, маслины, сыр фета, оливковое масло', 480, 4, 'greek'),
    (N'Кобб', N'250г Курица, бекон, яйца, авокадо, помидоры, салат, соус', 550, 4, 'cobb'),
    (N'Капрезе', N'200г Помидоры, моцарелла, базилик, оливковое масло', 420, 4, 'caprese'),
    (N'Сельдь под шубой', N'250г Сельдь, картофель, морковь, лук, майонез', 400, 4, 'herring_under_fur_coat'),
    (N'Летний', N'200г Огурцы, помидоры, перец, зелень, оливковое масло', 380, 4, 'summer'),
    -- Напитки
    (N'Колла', N'500мл', 100, 5, 'colla'),
    (N'Апельсиновый сок', N'500мл Свежевыжатый апельсиновый сок', 150, 5, 'orange_juice'),
    (N'Лимонад', N'500мл Освежающий домашний лимонад', 120, 5, 'lemonade'),
    (N'Морс', N'500мл Ягодный морс', 130, 5, 'fruit_drink'),
    (N'Минеральная вода', N'500мл Газированная минеральная вода', 80, 5, 'mineral_water'),
    (N'Чай', N'500мл Ароматный черный чай с лимоном', 90, 5, 'tea');

 
    